eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_randWrite_coldCache_4096bs_Ext4_1thread_asynchOff_xfs
Disk stats (read/write):
  sda: ios=10605/2112498, merge=6229/36060, ticks=4792/902262, in_queue=520076, util=99.27%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=921: Fri May 23 17:04:53 2025
  write: IOPS=4231, BW=16.5MiB/s (17.3MB/s)(8192MiB/495644msec)
    clat (usec): min=157, max=1636.7k, avg=233.30, stdev=8660.07
     lat (usec): min=157, max=1636.7k, avg=233.58, stdev=8660.07
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  167], 10.00th=[  169], 20.00th=[  169],
     | 30.00th=[  169], 40.00th=[  172], 50.00th=[  172], 60.00th=[  172],
     | 70.00th=[  174], 80.00th=[  176], 90.00th=[  186], 95.00th=[  194],
     | 99.00th=[  212], 99.50th=[  225], 99.90th=[  359], 99.95th=[  486],
     | 99.99th=[ 2835]
   bw (  KiB/s): min=    8, max=24024, per=100.00%, avg=19774.61, stdev=5874.82, samples=848
   iops        : min=    2, max= 6006, avg=4943.63, stdev=1468.70, samples=848
  lat (usec)   : 250=99.75%, 500=0.20%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 250=0.01%
  lat (msec)   : 500=0.01%, 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.75%, sys=52.22%, ctx=2099696, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=16.5MiB/s (17.3MB/s), 16.5MiB/s-16.5MiB/s (17.3MB/s-17.3MB/s), io=8192MiB (8590MB), run=495644-495644msec

Disk stats (read/write):
  sda: ios=6/2097921, merge=0/286, ticks=12/588059, in_queue=244344, util=100.00%