eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_seqWrite_coldCache_4096bs_Ext4_1thread_asynchOff_btrfs
Disk stats (read/write):
  sda: ios=8812/2107401, merge=6053/26635, ticks=2672/429365, in_queue=41764, util=99.03%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=920: Fri May 23 17:44:52 2025
  write: IOPS=5505, BW=21.5MiB/s (22.6MB/s)(8192MiB/380892msec)
    clat (usec): min=160, max=301187, avg=179.97, stdev=774.61
     lat (usec): min=160, max=301188, avg=180.19, stdev=774.61
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  169], 10.00th=[  169], 20.00th=[  172],
     | 30.00th=[  172], 40.00th=[  172], 50.00th=[  172], 60.00th=[  174],
     | 70.00th=[  174], 80.00th=[  178], 90.00th=[  186], 95.00th=[  192],
     | 99.00th=[  212], 99.50th=[  239], 99.90th=[  449], 99.95th=[  529],
     | 99.99th=[ 2671]
   bw (  KiB/s): min=10576, max=23912, per=99.99%, avg=22020.44, stdev=1895.12, samples=761
   iops        : min= 2644, max= 5978, avg=5505.09, stdev=473.78, samples=761
  lat (usec)   : 250=99.55%, 500=0.39%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.08%, sys=67.30%, ctx=2100297, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=21.5MiB/s (22.6MB/s), 21.5MiB/s-21.5MiB/s (22.6MB/s-22.6MB/s), io=8192MiB (8590MB), run=380892-380892msec

Disk stats (read/write):
  sda: ios=19/2098979, merge=0/433, ticks=8/362940, in_queue=18576, util=100.00%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=921: Fri May 23 17:59:20 2025
  write: IOPS=5457, BW=21.3MiB/s (22.4MB/s)(8192MiB/384300msec)
    clat (usec): min=160, max=153069, avg=181.67, stdev=726.07
     lat (usec): min=160, max=153069, avg=181.94, stdev=726.07
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  172], 40.00th=[  174], 50.00th=[  174], 60.00th=[  174],
     | 70.00th=[  176], 80.00th=[  180], 90.00th=[  190], 95.00th=[  194],
     | 99.00th=[  215], 99.50th=[  239], 99.90th=[  461], 99.95th=[  537],
     | 99.99th=[ 2606]
   bw (  KiB/s): min=12407, max=23920, per=99.99%, avg=21826.08, stdev=1838.83, samples=768
   iops        : min= 3101, max= 5980, avg=5456.50, stdev=459.71, samples=768
  lat (usec)   : 250=99.55%, 500=0.38%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.84%, sys=67.16%, ctx=2100149, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=21.3MiB/s (22.4MB/s), 21.3MiB/s-21.3MiB/s (22.4MB/s-22.4MB/s), io=8192MiB (8590MB), run=384300-384300msec

Disk stats (read/write):
  sda: ios=19/2098159, merge=0/436, ticks=9/365977, in_queue=17976, util=100.00%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=922: Fri May 23 18:08:23 2025
  write: IOPS=5376, BW=21.0MiB/s (22.0MB/s)(8192MiB/390088msec)
    clat (usec): min=160, max=138241, avg=184.49, stdev=723.99
     lat (usec): min=160, max=138241, avg=184.79, stdev=723.99
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  172], 40.00th=[  174], 50.00th=[  174], 60.00th=[  176],
     | 70.00th=[  186], 80.00th=[  190], 90.00th=[  194], 95.00th=[  202],
     | 99.00th=[  221], 99.50th=[  251], 99.90th=[  461], 99.95th=[  570],
     | 99.99th=[ 2671]
   bw (  KiB/s): min=14240, max=23880, per=99.99%, avg=21502.26, stdev=1583.29, samples=780
   iops        : min= 3560, max= 5970, avg=5375.54, stdev=395.82, samples=780
  lat (usec)   : 250=99.50%, 500=0.42%, 750=0.06%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.69%, sys=66.02%, ctx=2100210, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=21.0MiB/s (22.0MB/s), 21.0MiB/s-21.0MiB/s (22.0MB/s-22.0MB/s), io=8192MiB (8590MB), run=390088-390088msec

Disk stats (read/write):
  sda: ios=19/2098185, merge=0/438, ticks=9/371844, in_queue=18016, util=100.00%